tutorials/fluidSolidInteraction-preCICE/flexibleOversetCylinder/fluid/cylinderAndBackground/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-5 -0.05 -4.0)
    ( 9 -0.05 -4.0)
    ( 9  0.05 -4.0)
    (-5  0.05 -4.0)
    (-5 -0.05  4.0)
    ( 9 -0.05  4.0)
    ( 9  0.05  4.0)
    (-5  0.05  4.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (120 1 60) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    topAndBottom
    {
        type patch;
        faces
        (
            (4 5 6 7)
            (0 3 2 1)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
);

// ************************************************************************* //
